# Footcandles Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..Footcandles Property
UnitTypeId Class See Also
---
Footcandles.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Footcandles { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Footcandles As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Footcandles {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace